i10 : 10
i10 : 10, 10, 0
i10 : 10, 10, 0, 10, 0, 0, 0
i10 : 10, 10, 0, 10, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0
i15 : 10, 10, 15, 10, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0
i12 : 10, 10, 15, 10, 0, 12, 0, 10, 0, 0, 0, 0, 0, 0, 0
s10 : Exist
d10 : 12, 10, 15, 10, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0
d10 : 12, 10, 15, 10, 0, 0, 0
d10 : 12, 10, 15
d10 : 12, 0, 15
d10 : Not Exist
i17 : 12, 0, 15, 0, 0, 0, 17
i7 : 12, 7, 15, 0, 0, 0, 17
i11 : 12, 7, 15, 0, 11, 0, 17
i14 : 12, 7, 15, 0, 11, 14, 17
i16 : 12, 7, 15, 0, 11, 14, 17, 0, 0, 0, 0, 0, 0, 16, 0
i19 : 12, 7, 15, 0, 11, 14, 17, 0, 0, 0, 0, 0, 0, 16, 19
i20 : 12, 7, 15, 0, 11, 14, 17, 0, 0, 0, 0, 0, 0, 16, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20
s10 : Not Exist
s19 : Exist
